paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_net_beacon.c
nrf_mesh_assertion_handler_t m_assertion_handler;

static uint8_t * mp_expected_net_id;
static nrf_mesh_beacon_info_t ** mpp_infos;
static uint32_t m_info_count;
static uint32_t m_info_index;
static timer_sch_callback_t m_timer_cb;
static uint32_t m_rand_value;
static uint32_t m_time_now;

static void assert_handler(uint32_t pc)
{
    TEST_FAIL_MESSAGE("Assert triggered");
}

void setUp(void)
{
    mp_expected_net_id = NULL;
    m_info_index = 0;
    m_info_count = 0;
    mpp_infos = NULL;
    m_timer_cb = NULL;
    m_time_now = 0;
    m_assertion_handler = assert_handler;
    CMOCK_SETUP(beacon);
    CMOCK_SETUP(net_state);
    CMOCK_SETUP(timer_scheduler);
    CMOCK_SETUP(timer);
    CMOCK_SETUP(enc);

    signal(SIGSEGV, handler);
}

void tearDown(void)
{
    CMOCK_TEARDOWN();
}

void nrf_mesh_beacon_info_next_get(const uint8_t * p_network_id, const nrf_mesh_beacon_info_t ** pp_beacon_info)
{
    if (p_network_id == NULL)
    {
        TEST_ASSERT_EQUAL_PTR(NULL, mp_expected_net_id);
    }
    else
    {
        TEST_ASSERT_EQUAL_HEX8_ARRAY(mp_expected_net_id, p_network_id, NRF_MESH_NETID_SIZE);
    }

    TEST_ASSERT_NOT_NULL(mpp_infos);
    TEST_ASSERT_NOT_EQUAL(0, m_info_count);
    TEST_ASSERT_TRUE(m_info_index <= m_info_count);

    if (m_info_index >= m_info_count)
    {
        *pp_beacon_info = NULL;
    }
    else
    {
        if (m_info_index == 0)
        {
            TEST_ASSERT_EQUAL(NULL, *pp_beacon_info);
        }
        *pp_beacon_info = mpp_infos[m_info_index];
    }

    m_info_index++;
}

void timer_sch_schedule_mock_cb(timer_event_t * p_event, int count)
{
    TEST_ASSERT_NOT_NULL(p_event);
    TEST_ASSERT_NOT_NULL(p_event->cb);
    TEST_ASSERT_EQUAL(SEC_TO_US(NRF_MESH_BEACON_SECURE_NET_BCAST_INTERVAL_SECONDS / 2), p_event->interval);
    TEST_ASSERT_TRUE(m_time_now + SEC_TO_US(NRF_MESH_BEACON_SECURE_NET_BCAST_INTERVAL_SECONDS / 2) > p_event->timestamp);
    TEST_ASSERT_TRUE(m_time_now < p_event->timestamp);
    m_timer_cb = p_event->cb;
}

void setup_module(void)
{
    m_rand_value = 123456789; // larger than the beacon interval
    rand_hw_rng_get_Expect(NULL, 4);
    rand_hw_rng_get_IgnoreArg_p_result();
    rand_hw_rng_get_ReturnMemThruPtr_p_result((uint8_t*) &m_rand_value, 4);
    uint8_t dummy_salt[NRF_MESH_KEY_SIZE] = {0, 1, 2, 3, 4, 5, 6, 7, 0, 1, 2, 3, 4, 5, 6, 7};
    enc_s1_ExpectWithArray((const uint8_t*) "nkbk", 4, 4, NULL, 0);
    enc_s1_IgnoreArg_p_out();
    enc_s1_ReturnMemThruPtr_p_out(dummy_salt, NRF_MESH_KEY_SIZE);
    timer_now_ExpectAndReturn(1000);
    timer_sch_schedule_StubWithCallback(timer_sch_schedule_mock_cb);

    net_beacon_init();
    TEST_ASSERT_NOT_NULL(m_timer_cb);
}
/*****************************************************************************
* Tests
*****************************************************************************/
void test_tx_single(void)
{
    setup_module();

    net_beacon_sample_data_t sample_datas[] = {SEC_NET_SAMPLE_DATA_1, SEC_NET_SAMPLE_DATA_2, SEC_NET_SAMPLE_DATA_3};
#define SAMPLE_COUNT (sizeof(sample_datas) / sizeof(sample_datas[0]))

    /* single sample data */
    for (uint32_t i = 0; i < SAMPLE_COUNT; i++)
    {
        nrf_mesh_beacon_tx_info_t tx_info;
        net_beacon_sample_data_t sample_data = sample_datas[i];
        tx_info.tx_interval_seconds = 0;
        tx_info.tx_timestamp = 0;
        tx_info.rx_count = 0;
        sample_data.info.p_tx_info = &tx_info;

        nrf_mesh_beacon_info_t * p_info[] = {&sample_data.info};
        mpp_infos = p_info;
        m_info_count = 1;

        m_info_index = 0;
        m_time_now = SEC_TO_US(5);

        /* Test packet creation */
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        beacon_tx_ExpectWithArrayAndReturn(BEACON_TYPE_SEC_NET_BCAST, sample_data.beacon, 21, 21, 1, NRF_SUCCESS);

        /* Call the timeout */
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        /* Run again - this time, we haven't waited long enough, and it won't send a beacon */
        m_info_index = 0;
        m_time_now += SEC_TO_US(5);
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        beacon_mock_Verify();

        /* Run again, fail bearer_tx */
        m_info_index = 0;
        m_time_now += SEC_TO_US(5) + 1;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        beacon_tx_ExpectWithArrayAndReturn(BEACON_TYPE_SEC_NET_BCAST, sample_data.beacon, 21, 21, 1, NRF_ERROR_NO_MEM);

        /* Call the timeout */
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        beacon_mock_Verify();
    }

#undef SAMPLE_COUNT
}

/**
 * Test that we can run through multiple subnets on tx
 */
void test_tx_multi(void)
{
    setup_module();

#define NETWORKS    5
    /* multiple sample data */
    nrf_mesh_beacon_info_t info[NETWORKS];
    uint8_t beacon_data[13][NETWORKS];
    nrf_mesh_beacon_tx_info_t tx_info[NETWORKS];
    nrf_mesh_beacon_info_t * p_info[NETWORKS];
    for (uint32_t i = 0; i < NETWORKS; i++)
    {
        tx_info[i].rx_count = 0;
        tx_info[i].tx_timestamp = 0;
        tx_info[i].tx_interval_seconds = 0;
        info[i].p_tx_info = &tx_info[i];
        p_info[i] = &info[i];
        memset(&beacon_data[0][i], i, 13);
    }
    mpp_infos = p_info;
    m_info_count = NETWORKS;

    m_info_index = 0;
    m_time_now = SEC_TO_US(5);

    /* Test packet creation */
    for (uint32_t j = 0; j < NETWORKS; j++)
    {
        enc_aes_cmac_ExpectWithArray(info[j].secmat.key, NRF_MESH_KEY_SIZE, &beacon_data[0][j], 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_data();
        enc_aes_cmac_IgnoreArg_p_result();
        beacon_tx_ExpectAndReturn(BEACON_TYPE_SEC_NET_BCAST, NULL, 21, 1, NRF_SUCCESS);
        beacon_tx_IgnoreArg_p_payload();
    }

