paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_net_beacon.c
    /* Call the timeout */
    net_state_beacon_iv_index_get_ExpectAndReturn(0x12345678);
    net_state_iv_update_get_ExpectAndReturn(NET_STATE_IV_UPDATE_NORMAL);
    m_timer_cb(m_time_now, NULL);
    enc_mock_Verify();
    beacon_mock_Verify();

    /* Run again - this time, we haven't waited long enough, and it won't send any beacons */
    m_info_index = 0;
    m_time_now += SEC_TO_US(5);
    net_state_beacon_iv_index_get_ExpectAndReturn(0x12345678);
    net_state_iv_update_get_ExpectAndReturn(NET_STATE_IV_UPDATE_NORMAL);
    m_timer_cb(m_time_now, NULL);

    beacon_mock_Verify();
#undef NETWORKS
}

void test_pkt_in(void)
{
    setup_module();

    net_beacon_sample_data_t sample_datas[] = {SEC_NET_SAMPLE_DATA_1, SEC_NET_SAMPLE_DATA_2, SEC_NET_SAMPLE_DATA_3};
#define SAMPLE_COUNT (sizeof(sample_datas) / sizeof(sample_datas[0]))
    for (uint32_t i = 0; i < SAMPLE_COUNT; i++)
    {
        nrf_mesh_beacon_tx_info_t tx_info;
        net_beacon_sample_data_t sample_data = sample_datas[i];
        tx_info.tx_interval_seconds = 0;
        tx_info.tx_timestamp = 0;
        tx_info.rx_count = 0;
        sample_data.info.p_tx_info = &tx_info;

        nrf_mesh_beacon_info_t * p_info[] = {&sample_data.info};
        mpp_infos = p_info;
        m_info_count = 1;
        mp_expected_net_id = sample_data.info.secmat.net_id;

        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        net_state_beacon_received_Expect(sample_data.iv_index, sample_data.iv_update, sample_data.key_refresh);
        net_beacon_pkt_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(1, sample_data.info.p_tx_info->rx_count);

        /* Try again, should bump the tx count */
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        net_state_beacon_received_Expect(sample_data.iv_index, sample_data.iv_update, sample_data.key_refresh);
        net_beacon_pkt_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(2, sample_data.info.p_tx_info->rx_count);

        /* Try again without permitting IV update. Shouldn't forward to net state module, but should count the RX */
        sample_data.info.iv_update_permitted = false;
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        net_beacon_pkt_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(3, sample_data.info.p_tx_info->rx_count);


        /* Don't roll over the rx count */
        m_info_index = 0;
        sample_data.info.iv_update_permitted = true;
        sample_data.info.p_tx_info->rx_count = 0xFFFF;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        net_state_beacon_received_Expect(sample_data.iv_index, sample_data.iv_update, sample_data.key_refresh);
        net_beacon_pkt_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(0xFFFF, sample_data.info.p_tx_info->rx_count);

        /* Invalid auth, shouldn't handle the beacon: */
        uint8_t dummy_auth[NRF_MESH_KEY_SIZE];
        memset(dummy_auth, 0xDA, NRF_MESH_KEY_SIZE);
        sample_data.info.p_tx_info->rx_count = 0;
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(dummy_auth, 16);
        net_beacon_pkt_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count);
    }
#undef SAMPLE_COUNT
}

void test_pkt_in_multi(void)
{
    setup_module();

    /* This is stupid, but we need individual storage of the same beacon+auth
     * multiple times for lookup into our own beacons, as they'll hold
     * different tx info pointers. */
    net_beacon_sample_data_t stored_beacons[] =
    {
        SEC_NET_SAMPLE_DATA_1,
        SEC_NET_SAMPLE_DATA_1,
        SEC_NET_SAMPLE_DATA_1
    };
    /* Invalidate the second auth, making this one fail verification. */
    memset(stored_beacons[1].auth, 0x56, NRF_MESH_KEY_SIZE);

    /* Yield 3 networks on lookup with NET ID */
    nrf_mesh_beacon_info_t * p_info[] =
    {
        &stored_beacons[0].info,
        &stored_beacons[1].info,
        &stored_beacons[2].info
    };
#define INFO_COUNT  (sizeof(p_info) / sizeof(p_info[0]))
    nrf_mesh_beacon_tx_info_t tx_infos[INFO_COUNT];
    memset(tx_infos, 0, sizeof(tx_infos));
    for (uint32_t j = 0; j < INFO_COUNT; j++)
    {
        p_info[j]->p_tx_info = &tx_infos[j];
    }

    mpp_infos = p_info;
    m_info_count = INFO_COUNT;

    net_beacon_sample_data_t sample_data = SEC_NET_SAMPLE_DATA_1;

    mp_expected_net_id = sample_data.info.secmat.net_id;

    m_info_index = 0;
    for (uint32_t j = 0; j < INFO_COUNT; j++)
    {
        enc_aes_cmac_ExpectWithArray(p_info[j]->secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(stored_beacons[j].auth, 16);
    }
    net_state_beacon_received_Expect(sample_data.iv_index, sample_data.iv_update, sample_data.key_refresh);
    net_state_beacon_received_Expect(sample_data.iv_index, sample_data.iv_update, sample_data.key_refresh);
    net_beacon_pkt_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
    TEST_ASSERT_EQUAL(1, tx_infos[0].rx_count);
    TEST_ASSERT_EQUAL(0, tx_infos[1].rx_count); /* Had invalid auth, didn't get a match */
    TEST_ASSERT_EQUAL(1, tx_infos[2].rx_count);
#undef INFO_COUNT
}

void test_beacon_state_change(void)
{
    setup_module();
    TEST_ASSERT_EQUAL(true, net_beacon_state_get());

    /* Enable the beacon while already enabled: */
    net_beacon_state_set(true);
    TEST_ASSERT_EQUAL(true, net_beacon_state_get());

    /* Disable the beacon while running: */
    timer_sch_abort_Expect(NULL);
    timer_sch_abort_IgnoreArg_p_timer_evt();
    net_beacon_state_set(false);
    TEST_ASSERT_EQUAL(false, net_beacon_state_get());

