paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_net_beacon.c
    /* Disable the beacon while already disabled: */
    net_beacon_state_set(false);
    TEST_ASSERT_EQUAL(false, net_beacon_state_get());

    /* Enable the beacon while disabled: */
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(NULL, 0);
    timer_sch_reschedule_IgnoreArg_p_timer_evt();
    timer_sch_reschedule_IgnoreArg_new_timestamp();
    net_beacon_state_set(true);
    TEST_ASSERT_EQUAL(true, net_beacon_state_get());
}

/**
 * Test that receiving beacons for a specific network slows down the retransmit rate
 */
void test_redundant_tx(void)
{
    setup_module();

    net_beacon_sample_data_t sample_datas[] = {SEC_NET_SAMPLE_DATA_1, SEC_NET_SAMPLE_DATA_2, SEC_NET_SAMPLE_DATA_3};
#define SAMPLE_COUNT (sizeof(sample_datas) / sizeof(sample_datas[0]))
    for (uint32_t i = 0; i < SAMPLE_COUNT; i++)
    {
        nrf_mesh_beacon_tx_info_t tx_info;
        net_beacon_sample_data_t sample_data = sample_datas[i];
        tx_info.tx_interval_seconds = 0;
        tx_info.tx_timestamp = 0;
        tx_info.rx_count = 0;
        sample_data.info.p_tx_info = &tx_info;

        nrf_mesh_beacon_info_t * p_info[] = {&sample_data.info};
        mpp_infos = p_info;
        m_info_count = 1;

        /* Always transmit a beacon on the first timeout. */
        m_time_now = SEC_TO_US(5);
        sample_data.info.p_tx_info->rx_count = 1; // Received 1 beacon this 5 second period, should transmit after 30 seconds.
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        beacon_tx_ExpectWithArrayAndReturn(BEACON_TYPE_SEC_NET_BCAST, sample_data.beacon, 21, 21, 1, NRF_SUCCESS);

        /* Call the timeout */
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);
        /* we saw 1 beacon in the first 5 seconds, expecting 30 second interval for the second. */
        TEST_ASSERT_EQUAL(30, sample_data.info.p_tx_info->tx_interval_seconds);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count); // should be reset on each transmit.
        TEST_ASSERT_EQUAL(m_time_now, sample_data.info.p_tx_info->tx_timestamp); // should be reset on each transmit.

        /* Nothing happens until T=5+30 */
        m_time_now = SEC_TO_US(20);
        m_info_index = 0;
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        m_time_now = SEC_TO_US(34);
        m_info_index = 0;
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        /* T > 35, transmit! */
        m_time_now = SEC_TO_US(35);
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        beacon_tx_ExpectWithArrayAndReturn(BEACON_TYPE_SEC_NET_BCAST, sample_data.beacon, 21, 21, 1, NRF_SUCCESS);
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);
        /* Didn't receive any beacons this period, bring interval down to 10 seconds: */
        TEST_ASSERT_EQUAL(10, sample_data.info.p_tx_info->tx_interval_seconds);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count); // should be reset on each transmit.
        TEST_ASSERT_EQUAL(m_time_now, sample_data.info.p_tx_info->tx_timestamp); // should be reset on each transmit.

        /* Nothing happens until T=35+10 */
        m_time_now = SEC_TO_US(40);
        m_info_index = 0;
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        /* T > 45, transmit! */
        sample_data.info.p_tx_info->rx_count = 2;
        m_time_now = SEC_TO_US(45);
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        beacon_tx_ExpectWithArrayAndReturn(BEACON_TYPE_SEC_NET_BCAST, sample_data.beacon, 21, 21, 1, NRF_SUCCESS);
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);
        /* Received 2 beacons over 10 seconds, bring interval up to 30: */
        TEST_ASSERT_EQUAL(30, sample_data.info.p_tx_info->tx_interval_seconds);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count); // should be reset on each transmit.
        TEST_ASSERT_EQUAL(m_time_now, sample_data.info.p_tx_info->tx_timestamp); // should be reset on each transmit.

        /* Nothing happens until T=45+30 */
        m_time_now = SEC_TO_US(74);
        m_info_index = 0;
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        /* T > 75, transmit! */
        sample_data.info.p_tx_info->rx_count = 3;
        m_time_now = SEC_TO_US(75);
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        beacon_tx_ExpectWithArrayAndReturn(BEACON_TYPE_SEC_NET_BCAST, sample_data.beacon, 21, 21, 1, NRF_SUCCESS);
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);
        /* Received 3 beacons over 30 seconds, interval is 20: */
        TEST_ASSERT_EQUAL(20, sample_data.info.p_tx_info->tx_interval_seconds);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count); // should be reset on each transmit.
        TEST_ASSERT_EQUAL(m_time_now, sample_data.info.p_tx_info->tx_timestamp); // should be reset on each transmit.

    }
#undef SAMPLE_COUNT
}
